Documents/Ведомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Ведомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВедомостьДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.СимволыВедомости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Литеры</Name>
					<Comment>Строковые символы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыСтрокой</Name>
					<Comment>Перечень ГУИД ссылок справочника договоры (разделитель";")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыТаблицей</Name>
					<Comment>Таблица значений с колонкой из ссылок справочника  договоры</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь создавший документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВедомостьДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВедомостьДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Ведомость/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТекущийОбъект.Заполнить("");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УИД = Объект.Ссылка.УникальныйИдентификатор();
	ДатаДокументаДоИзменения = Объект.Дата;
		
	ЗаполнитьСписокДоговоровИзСтроки(Объект.ДоговорыСтрокой, ДоговорыВСтроке);
	ЗаполнитьСписокДоговоровИзХранилица(Объект.Ссылка, ДоговорыВХранилище);
	ЗаполнитьСписокДоговоровИзРегистра(Объект.Ссылка, ДоговорыВРегистре);
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовкаДанныхСписка(ТекущийОбъект.Договоры);
	ПодготовкаДанныхСписка(ДоговорыВСтроке);
	ПодготовкаДанныхСписка(ДоговорыВХранилище);
	ПодготовкаДанныхСписка(ДоговорыВРегистре);
	ПодготовкаДанныхСписка(ДоговорыВФайле);
	
	ТекущийОбъект.ДоговорыСтрокой = УникальныйИдентификаторСтрокой(ДоговорыВСтроке);
	ТекущийОбъект.ДоговорыТаблицей = Новый ХранилищеЗначения(ДоговорыВХранилище.Выгрузить());
	
	ТекущийОбъект.Заполнить("");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Запись движений в регистр сведений ВедомостьДоговоров
	НаборЗаписей = РегистрыСведений.ВедомостьДоговоров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ТекущийОбъект.Ссылка);
	
	Для Каждого Строка Из ДоговорыВРегистре Цикл 
		
		Если Строка.Договор <> Справочники.Договоры.ПустаяСсылка() Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Договор = Строка.Договор;
			НоваяЗапись.Период = ТекущийОбъект.Дата;	
		КонецЕсли;
		
	КонецЦикла; 
	
	Попытка
		
		НаборЗаписей.Записать();
		
	Исключение 
		
		Отказ = Истина;
		
		Информация = СтрШаблон(
			"В документе 'Ведомость'№ %1 от %2 ошибка записи регистра сведений 'ВедомостьДоговоров'.", 
			ТекущийОбъект.Номер, Формат(ТекущийОбъект.Дата, "ДЛФ=DDT"));
		
		ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация);

		ЗаписьЖурналаРегистрации(НСтр("ru = 'Данные.Запись'"),
			УровеньЖурналаРегистрации.Ошибка, РегистрыСведений.ВедомостьДоговоров, ТекущийОбъект.Ссылка,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НайтиИПрочитатьФайлXMLДляДокумента();
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы) 
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ВыгрузитьДанныеДоговоровВФайл_XML();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыВСтрокеДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ПараметрыФормы = Новый Структура;
	НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НачалоДействия");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = Объект.Дата;	
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновкиДанных);
	
	ОткрытьФорму("Справочник.Договоры.ФормаВыбора", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыВСтрокеДоговорАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Не ПустаяСтрока(Текст);
	
	ДанныеВыбора =  Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ДоговорыДляОтображения(Объект.Дата));
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДейсвиеПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ДоговораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элементы.Договора.ТекущиеДанные.Договор = ВыбранноеЗначение;
КонецПроцедуры 

&НаКлиенте
Процедура ДоговораДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.КонтрольЗаполненияТаблицыАктивнымиДоговорамиАсинх(Элементы.Договора, ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ГрупповоеИзменение(Команда)
	ОткрытиеФормыГрупповогоИзмененияДоговоров();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Валидирует заполнение значения константы 'ДопустимыеСимволыВедомости'.
//
&НаСервере
Процедура ПриЗакрытииНаСервере() 
		
	Если ОбщегоНазначенияСлужебныйСервер.ПустоеЗначениеКонстанты("ДопустимыеСимволыВедомости") Тогда
		 ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(
		   "Значение константы 'ДопустимыеСимволыВедомости' не заполнено."
		 );
	КонецЕсли;
	
КонецПроцедуры

// Заполнение списка Договоры формы документа
//
// Параметры:
//  УИДСтрокой  - Строка - содержимое реквизита документа Ведомость строкой, содержащей стороковые УИД
//  Коллекция  - ДанныеФормыКоллекция - пустой список для ссылок справочника Договоры
//
&НаСервере
Процедура ЗаполнитьСписокДоговоровИзСтроки(ГУИДСтрокой, Коллекция)
		Коллекция.Загрузить(ВедомостьСервер.КоллекцияДоговоровИзСтроки(ГУИДСтрокой));
КонецПроцедуры

// Заполнение списка Договоры формы документа
//
// Параметры:
//  Ведомость  - ДокументСсылка.Ведомость - ссылка на текущий документ
//  Коллекция  - ДанныеФормыКоллекция - пустой список для ссылок справочника Договоры
//
&НаСервере
Процедура ЗаполнитьСписокДоговоровИзХранилица(Ведомость, Коллекция)
	Коллекция.Загрузить(ВедомостьСервер.КоллекцияДоговоровИзХранилица(Ведомость));
КонецПроцедуры 

// Заполнение списка Договоры формы документа
//
// Параметры:
//  Ведомость  - ДокументСсылка.Ведомость - ссылка на текущий документ
//  Коллекция  - ДанныеФормыКоллекция - пустой список для ссылок справочника Договоры
//
&НаСервере
Процедура ЗаполнитьСписокДоговоровИзРегистра(Ведомость, Коллекция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьДоговоров.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.ВедомостьДоговоров КАК ВедомостьДоговоров
	|ГДЕ
	|	ВедомостьДоговоров.Регистратор = &Ведомость";
	
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	
	Коллекция.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры 

// Удалает дубли и пустые строки списков Договоры формы документа
//
// Параметры:
//  Коллекция  - ДанныеФормыКоллекция, ДокументТабличнаяЧастьСтрока.Ведомость.Договора  - содержит ссылки справочника Договоры
//
&НаСервере
Процедура ПодготовкаДанныхСписка(Коллекция) 
	
	ТаблЗначений = Коллекция.Выгрузить();
	
	Для Счетчик = -ТаблЗначений.Количество() + 1 По 0 Цикл
		
		Если ТаблЗначений[-Счетчик].Договор = Справочники.Договоры.ПустаяСсылка() Тогда
			ТаблЗначений.Удалить(-Счетчик);
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблЗначений.Свернуть("Договор");
	
	Коллекция.Загрузить(ТаблЗначений);
	
КонецПроцедуры

// Конвертирует уникальные идентификаторы ссылок справочника Договоры в строку.
//
// Параметры:
//  Коллекция  - ДанныеФормыКоллекция - содержит ссылки справочника Договоры.
//
// Возвращаемое значение:
//   Строка   - содержит уникальные идентификаторы в строковом представлении.
//
&НаСервере
Функция УникальныйИдентификаторСтрокой(Данные)
	
	Результат = "";
	
	Если ТипЗнч(Данные) = Тип("ДанныеФормыКоллекция") Тогда
		
		МассивСтроковыхУИД = Новый Массив;
		
		Для каждого Строка Из Данные Цикл
			МассивСтроковыхУИД.Добавить(XMLСтрока(Строка.Договор));
		КонецЦикла;
		
		Результат = СтрСоединить(МассивСтроковыхУИД, ";");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Диалог с пользователем при смене даты документа, и выполнение определенных действий на основе диалога.
//   Либо возвращает дату документа которая была перед изменением, либо сортирует список договоров, согласно
//   условию, где дата документа не может быть меньше даты начала договора.
//
&НаКлиенте
Асинх Процедура ДейсвиеПользователя()
	
	Предупреждение = "Вы изменили дату документа," + Символы.ПС +
		"договоры во второй колонке могут не соответствовать условиям заполнения," + Символы.ПС +
		"изменить дату и отфильтровать список договоров согласно условиям заполнения?";
	
	Обещание = ВопросАсинх(СтрШаблон(НСтр("ru ='%1'"), Предупреждение), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	РезультатОтвета = Ждать Обещание;  
	
	Если РезультатОтвета = КодВозвратаДиалога.Нет Тогда
		Объект.Дата = ДатаДокументаДоИзменения;
	Иначе
		
		ФильтрацияДоговоровПоДатеДокумента();
		
		ДатаДокументаДоИзменения = Объект.Дата;
		
	КонецЕсли; 
	
КонецПроцедуры 

// Удаляет из списка договора, даты начала которых больше даты документа.
//
&НаСервере
Процедура ФильтрацияДоговоровПоДатеДокумента()
	
	МассивСсылок = ДоговорыВСтроке.Выгрузить(,"Договор").ВыгрузитьКолонку("Договор");
	
  ДоговорыВСтроке.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.НачалоДействия <= &ДатаДокумента
	|	И Договоры.Ссылка В (&Ссылки)";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылки", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрТабЧасти = ДоговорыВСтроке.Добавить();
		СтрТабЧасти.Договор = Выборка.Договор;
	КонецЦикла;
		
КонецПроцедуры

// Подготовка списка выделенных договоров и открытие формы для группового изменения договоров.
//
&НаКлиенте
Процедура ОткрытиеФормыГрупповогоИзмененияДоговоров()
	
	ДоговорыДляИзменения = Новый Соответствие;
	ИменаТаблиц = СтрРазделить ("Договора,ДоговорыВСтроке,ДоговорыВХранилище,ДоговорыВРегистре", ",");
	
	Для Каждого Имя Из ИменаТаблиц Цикл
		ЗаполнениеСпискаВыделенныхДоговоров(ДоговорыДляИзменения, Имя);
	КонецЦикла;
	
	ПарамФормыГрупИзменения = Новый Структура("ДанныеДляИзменения, Владелец", ДоговорыДляИзменения);
	
	ОткрытьФорму("Документ.Ведомость.Форма.ФормаГрупповвогоИзмененияДоговоров",
		ПарамФормыГрупИзменения,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры 

// Заполнение списка значений договорами для изменения
//
// Параметры:
//  Коллекция  - СписокЗначений - коллекция выделенных договоров для изменения.
//  ИмяТаблицы  - Строка - Имя таблицы договоров.
//
&НаКлиенте
Процедура ЗаполнениеСпискаВыделенныхДоговоров(Коллекция, ИмяТаблицы)
	
	Для Каждого ИндексСтроки из Элементы[ИмяТаблицы].ВыделенныеСтроки Цикл
		ТекСтрока = Элементы[ИмяТаблицы].ДанныеСтроки(ИндексСтроки);
		Коллекция.Вставить(ТекСтрока.Договор);
	КонецЦикла;
	
КонецПроцедуры

 // Поиск договоров по дате документа
 //
 // Параметры:
 //  ДатаДокумента  - Дата - текущая дата документа
 //
 // Возвращаемое значение:
 //   Массив   - ссылки на элементы справочника.
 //
&НаСервереБезКонтекста
Функция ДоговорыДляОтображения(ДатаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.НачалоДействия <= &ДатаДокумента";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Создание файлов в формате XML и наполнение данными договоров из табличной части документа для хранения.
//
&НаСервере
Процедура ВыгрузитьДанныеДоговоровВФайл_XML();
	
	КаталогСохранения = СокрЛП(ВедомостьСервер.КаталогХраненияДоговоров());
	ПолныйПутьКФайлу = КаталогСохранения + "/" + Объект.Ссылка.УникальныйИдентификатор() + ".xml";
	
	ЗаписьXML	= Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПолныйПутьКФайлу);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Корневой");
	ЗаписьXML.ЗаписатьАтрибут("НомерДокумента-ИмяТабличнойЧасти", Объект.Номер + "-ДоговорыВФайле");
	ЗаписьXML.ЗаписатьКомментарий("Выгрузка элементов справочника");
		
	Попытка
		
		Для каждого СтрокаДанных Из ДоговорыВФайле Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементСправочника");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
			ЗаписьXML.ЗаписатьТекст(СтрокаДанных.Договор.Наименование);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("GUID");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрокаДанных.Договор));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла;  
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.Закрыть();
		
	Исключение 
		
		ЗаписьXML.Закрыть();
		
		Информация = "Неудалось записать файл по причине: " + ОписаниеОшибки();
		
		ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация);
		
		УдалитьФайлы(ПолныйПутьКФайлу);
		
		Возврат;
		
	КонецПопытки; 
	
КонецПроцедуры

// Заполнение табличной части документа договорами.
//
// Параметры:
//  МассивИдентификаторов  - Массив - массив наполненный строковыми идентификаторами GUID.
//
&НаСервере
Процедура ЗаполнитьТаблицуДоговорыВФайле(МассивИдентификаторов)
	ЗаполнитьСписокДоговоровИзСтроки(МассивИдентификаторов, ДоговорыВФайле);
КонецПроцедуры

// Поиск, чтение файла XML для заполнения табличной части ведомости.
//
&НаКлиенте
Асинх Процедура НайтиИПрочитатьФайлXMLДляДокумента() 
	
	Если Не Параметры.Ключ.Пустая() Тогда
		
		КаталогСохранения = СокрЛП(ВедомостьСервер.КаталогХраненияДоговоров());
		
		Обещание = НайтиФайлыАсинх(КаталогСохранения, Строка(Объект.Ссылка.УникальныйИдентификатор()) + ".xml", Ложь);
		
		Файлы = Ждать Обещание;
		
		Если Файлы.Количество() > 0 Тогда 
			
			МассивИдентификаторов = Новый Массив;
			
			ДанныеXMLФайла = Новый ЧтениеXML;
			
			Попытка
				
				ДанныеXMLФайла.ОткрытьФайл(КаталогСохранения + "/" + Объект.Ссылка.УникальныйИдентификатор() + ".xml");
				
				Пока ДанныеXMLФайла.Прочитать() Цикл
					
					Если ДанныеXMLФайла.Имя = "#text" И СтрДлина(ДанныеXMLФайла.Значение) = 36 Тогда
						МассивИдентификаторов.Добавить(ДанныеXMLФайла.Значение);
					КонецЕсли;
					
				КонецЦикла;
				
			Исключение 
				
				ДанныеXMLФайла.Закрыть();
				
				Информация = "Табличная часть ДоговорыВФайле не может быть заполнена." + Символы.ПС +
					"Неудалось открыть или прочитать файл по причине: " + ОписаниеОшибки();
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(Информация);
				
				Возврат;
				
			КонецПопытки;
			
			ДанныеXMLФайла.Закрыть();
			
			ЗаполнитьТаблицуДоговорыВФайле(МассивИдентификаторов);
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
